tutorials/rigidBodyAndBeam_ForceCoupledSolver/0/beam/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
60
(
(0.00143125 3.21406e-23 4.73387e-07)
(0.00429375 9.20394e-24 1.39733e-06)
(0.00715625 6.03518e-24 2.2852e-06)
(0.0100188 8.53439e-24 3.14327e-06)
(0.0128813 -3.5482e-24 3.96878e-06)
(0.0157438 4.26153e-24 4.7628e-06)
(0.0186063 -7.33345e-24 5.52502e-06)
(0.0214688 3.01887e-24 6.25543e-06)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    right
    {
        type            calculated;
        value           uniform (0.17175 0 0);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
