tutorials/rigidBodyAndBeam_ForceCoupledSolver/0/motionScale
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       pointScalarField;
    location    "0";
    object      motionScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
316755
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    left
    {
        type            calculated;
    }
    right
    {
        type            calculated;
    }
    front
    {
        type            calculated;
    }
    back
    {
        type            calculated;
    }
    bottom
    {
        type            calculated;
    }
    top
    {
        type            calculated;
    }
    floatingObject
    {
        type            calculated;
    }
}


// ************************************************************************* //
